//USERIDV JOB MSGLEVEL=(1,1),MSGCLASS=X,CLASS=A,NOTIFY=USERID
//* CREATE A KSDS FILE
//STEP010  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE USERID.VSAM.XYZ.KSDS CLUSTER PURGE
 SET MAXCC=0
 DEFINE CLUSTER (NAME(USERID.VSAM.XYZ.KSDS) -
        TRACKS(1 1) -
        KEYS(5 0) -
        RECORDSIZE(50 50) -
        INDEXED -
        ) -
        DATA (NAME(USERID.VSAM.XYZ.KSDS.DATA) -
        ) -
        INDEX (NAME(USERID.VSAM.XYZ.KSDS.INDEX) -
        )
/*
// SET INP=USERID.VSAM.EMPFILE1
//*SET INP=USERID.VSAM.EMPFILE2
//* SORTING AND INPUT PS FILE
//STEP020  EXEC PGM=SORT
//SYSOUT   DD SYSOUT=*
//SORTIN   DD DSN=&INP,DISP=SHR
//SORTOUT  DD DSN=&&TEMP,DISP=(NEW,PASS),
//            SPACE=(TRK,(1,1),RLSE),
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=5000)
//SYSIN    DD *
  SORT FIELDS=(1,5,CH,A)
  SUM FIELDS=NONE
/*
//STEP030  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//PSFILE   DD DSN=&&TEMP,DISP=OLD
//KSDSFILE DD DSN=USERID.VSAM.XYZ.KSDS,DISP=SHR
//SYSIN    DD *
 REPRO INFILE(PSFILE) -
      OUTFILE(KSDSFILE)
/*
//* CREATE A AIX ON LOC
//STEP040  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 /* IDCAMS COMMAND */
 DELETE USERID.VSAM.XYZ.KSDS.LOCAIX AIX PURGE
 SET MAXCC=0
 DEFINE ALTERNATEINDEX (NAME(USERID.VSAM.XYZ.KSDS.LOCAIX) -
        RELATE(USERID.VSAM.XYZ.KSDS) -
        TRACKS(1 1) -
        RECORDSIZE(23 38) -
        KEYS(3 20) -
        NONUNIQUEKEY -
        ) -
        DATA (NAME(USERID.VSAM.XYZ.KSDS.LOCAIX.DATA) -
        ) -
        INDEX (NAME(USERID.VSAM.XYZ.KSDS.LOCAIX.INDEX) -
        )
/*
//STEP050  EXEC PGM=IDCAMS
//BASE0    DD DSN=USERID.VSAM.XYZ.KSDS,DISP=SHR
//AIX1     DD DSN=USERID.VSAM.XYZ.KSDS.LOCAIX,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 BLDINDEX INFILE(BASE0) -
         OUTFILE(AIX1)
/*
//STEP060  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE USERID.VSAM.XYZ.KSDS.LOCAIX.PATH PATH PURGE
 SET MAXCC=0
 DEFINE PATH (NAME(USERID.VSAM.XYZ.KSDS.LOCAIX.PATH) -
        PATHENTRY(USERID.VSAM.XYZ.KSDS.LOCAIX) )
/*
//STEP070  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 /* IDCAMS COMMAND */
 DELETE USERID.VSAM.XYZ.KSDS.TECAIX AIX PURGE
 SET MAXCC=0
 DEFINE ALTERNATEINDEX (NAME(USERID.VSAM.XYZ.KSDS.TECAIX) -
        RELATE(USERID.VSAM.XYZ.KSDS) -
        TRACKS(1 1) -
        RECORDSIZE(24 39) -
        KEYS(4 31) -
        NONUNIQUEKEY -
        ) -
        DATA (NAME(USERID.VSAM.XYZ.KSDS.TECAIX.DATA) -
        ) -
        INDEX (NAME(USERID.VSAM.XYZ.KSDS.TECAIX.INDEX) -
        )
/*
//STEP080  EXEC PGM=IDCAMS
//BASE0    DD DSN=USERID.VSAM.XYZ.KSDS,DISP=SHR
//AIX2     DD DSN=USERID.VSAM.XYZ.KSDS.TECAIX,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 BLDINDEX INFILE(BASE0) -
         OUTFILE(AIX2)
/*
//STEP090  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DELETE USERID.VSAM.XYZ.KSDS.TECAIX.PATH PATH PURGE
 SET MAXCC=0
 DEFINE PATH (NAME(USERID.VSAM.XYZ.KSDS.TECAIX.PATH) -
        PATHENTRY(USERID.VSAM.XYZ.KSDS.TECAIX) )
/*
