WORKING-STORAGE SECTION.
01  WS-CA                           PIC X(01).
LINKAGE SECTION.
01  DFHCOMMAREA       PIC X(01).
PROCEDURE DIVISION.
    IF EIBCALEN = ZERO
                PERFORM FIRST-PARA
    ELSE
                PERFORM NEXT-PARA
    END-IF
    EXEC CICS RETURN
                TRANSID('ABCD')
                COMMAREA(WS-CA)
    END-EXEC.
FIRST-PARA.
    EXEC CICS SEND
                MAP('CALMAP')
                MAPSET('CALMSET')
                FROM(CALMAPO)
                ERASE
    END-EXEC.
NEXT-PARA.
    IF PF3
                EXEC CICS RETURN
                END-EXEC
    ELSE
                MOVE DFHCOMMAREA TO WS-CA
                RECEIVE MAP
                PROCESS DATA
                SEND MAP
   END-IF.
