//DSRP001C JOB ABCD,'CAP GEMINI',MSGLEVEL=(1,1),
//         MSGCLASS=X,CLASS=A,NOTIFY=&SYSUID    
//*                                             
//STEP010  EXEC PGM=IEBCOPY                     
//INPDS    DD DSN=DSRP001.TEST.PDS1,DISP=OLD    
//SYSPRINT DD SYSOUT=*                          
//SYSIN    DD *                                 
  COPY INDD=INPDS,OUTDD=INPDS                   
/*                                              
