IDENTIFICATION DIVISION.
PROGRAM-ID. PROG01.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  WS-CA       PIC X(01).
01  WS-IN1      PIC 9(02).
01  WS-IN2      PIC 9(02).
01  WS-OUT      PIC 9(03).
01  WS-MESSAGE  PIC X(30) VALUE
     'END OF THE PROGRAM, BYE, BYE!!'.
     COPY 'CALMSET.COB'.
     COPY DFHAID. 
 LINKAGE SECTION.
01  DFHCOMMAREA     PIC X(01).
PROCEDURE DIVISION.
MAIN-PARA.
     IF EIBCALEN = ZERO
         PERFORM FIRST-PARA
     ELSE
         PERFORM NEXT-PARA
    END-IF.
END-PARA.
     EXEC CICS RETURN
         TRANSID('CALC')
         COMMAREA(WS-CA)
     END-EXEC
FIRST-PARA.
     EXEC CICS SEND
         MAP('CALMAP')
         MAPSET('CALMSET')
         FROM (CALMAPO)
         ERASE
     END-EXEC.
NEXT-PARA.
     IF EIBAID = DFHPF3
         EXEC CICS SEND TEXT
             FROM(WS-MESSAGE)
*            LENGTH(30)
             ERASE
         END-EXEC
         EXEC CICS RETURN
         END-EXEC
     ELSE
     IF EIBAID = DFHENTER
         PERFORM PROCESS-PARA
     ELSE
         MOVE 'INVALID KEY PRESSED' TO MESSAGEO
     END-IF
     END-IF.
PROCESS-PARA.
     PERFORM RECEIVE-MAP.
     IF INPUT1L = ZERO OR INPUT1I = '00' OR
        INPUT2L = ZERO OR INPUT2I = '00'
        MOVE 'PLEASE ENTER VALID INPUTS' TO MESSAGEO
     ELSE
        MOVE INPUT1I TO WS-IN1
        MOVE INPUT2I TO WS-IN2
        COMPUTE WS-OUT = WS-IN1 + WS-IN2
        MOVE WS-OUT  TO OUTPUTO
        MOVE 'SUM OF 2 NUMBERS IS DISPLAYED' MESSAGEO
     END-IF.     
 RECEIVE-MAP.
     EXEC CICS RECEIVE
         MAP('CALMAP')
         MAPSET('CALMSET')
         INTO(CALMAPI)
     END-EXEC.
